// Copyright (c) 2022 Akihiro Yamamoto.
// Licensed under the MIT License <https://spdx.org/licenses/MIT.html>
// See LICENSE file in the project root for full license information.
//
#pragma once
#include "Application.hpp"
#include <ArduinoJson.h>
#include <array>
#include <chrono>
#include <cstdint>
#include <ctime>
#include <iomanip>
#include <map>
#include <queue>
#include <ratio>
#include <sstream>
#include <string>
#include <tuple>
#include <variant>
#include <vector>

using namespace std::literals::string_literals;
using namespace std::literals::string_view_literals;

//
std::string iso8601formatUTC(std::time_t utctime) {
  struct tm tm;
  gmtime_r(&utctime, &tm);
  char buffer[30]{'\0'};
  std::strftime(buffer, std::size(buffer), "%Y-%m-%dT%H:%M:%SZ", &tm);
  return std::string(buffer);
}

// ECHONET Lite の UDP ポート番号
constexpr std::string_view EchonetLiteUdpPort{"0E1A"};

// ECHONET Lite 電文ヘッダー
struct EchonetLiteEHeader final {
  uint8_t u8[2];
};
static_assert(sizeof(EchonetLiteEHeader) == 2);

//
bool operator==(const EchonetLiteEHeader &left,
                const EchonetLiteEHeader &right) {
  return std::equal(std::begin(left.u8), std::end(left.u8),  /**/
                    std::begin(right.u8), std::end(right.u8) /**/
  );
}
//
std::string to_string(EchonetLiteEHeader ehd) {
  std::ostringstream oss;
  oss << std::uppercase << std::hex;
  oss << std::setfill('0') << std::setw(2) << +ehd.u8[0];
  oss << std::setfill('0') << std::setw(2) << +ehd.u8[1];
  return oss.str();
}

// ECHONET Lite 電文ヘッダー
// 0x1081で固定
// EHD1: 0x10 (ECHONET Lite規格)
// EHD2: 0x81 (規定電文形式)
constexpr EchonetLiteEHeader EchonetLiteEHD{0x10, 0x81};

// ECHONET Lite オブジェクト指定
union EchonetLiteObjectCode {
  uint8_t u8[3]; // 3バイト表現(デフォルトコンストラクタ)
  struct {
    uint8_t class_group;   // byte.1 クラスグループコード
    uint8_t class_code;    // byte.2 クラスコード
    uint8_t instance_code; // byte.3 インスタンスコード
  };
};
static_assert(sizeof(EchonetLiteObjectCode) == 3);

//
bool operator==(const EchonetLiteObjectCode &left,
                const EchonetLiteObjectCode &right) {
  return std::equal(std::begin(left.u8), std::end(left.u8),  /**/
                    std::begin(right.u8), std::end(right.u8) /**/
  );
}

//
std::string to_string(EchonetLiteObjectCode eoj) {
  std::ostringstream oss;
  oss << std::uppercase << std::hex;
  oss << std::setfill('0') << std::setw(2) << +eoj.u8[0];
  oss << std::setfill('0') << std::setw(2) << +eoj.u8[1];
  oss << std::setfill('0') << std::setw(2) << +eoj.u8[2];
  return oss.str();
}

// トランザクションID
struct EchonetLiteTransactionId final {
  uint8_t u8[2];
};
static_assert(sizeof(EchonetLiteTransactionId) == 2);

//
std::string to_string(EchonetLiteTransactionId tid) {
  std::ostringstream oss;
  oss << std::uppercase << std::hex;
  oss << std::setfill('0') << std::setw(2) << +tid.u8[0];
  oss << std::setfill('0') << std::setw(2) << +tid.u8[1];
  return oss.str();
}

// ECHONET Liteサービス
enum class EchonetLiteESV : uint8_t {
  SetC_SNA = 0x51, // プロパティ値書き込み要求不可応答
  Get_SNA = 0x52,  // プロパティ値読み出し不可応答
  SetC = 0x61,     // プロパティ値書き込み要求（応答要）
  Get = 0x62,      // プロパティ値読み出し要求
  Set_Res = 0x71,  // プロパティ値書き込み応答
  Get_Res = 0x72,  // プロパティ値読み出し応答
  INF = 0x73,      // プロパティ値通知
  INFC = 0x74,     // プロパティ値通知（応答要）
  INFC_Res = 0x7A, // プロパティ値通知応答
};
static_assert(sizeof(EchonetLiteESV) == 1);

std::string to_string(EchonetLiteESV esv) {
  std::ostringstream oss;
  oss << std::uppercase << std::hex;
  oss << std::setfill('0') << std::setw(2) << +static_cast<uint8_t>(esv);
  return oss.str();
}

// ECHONET Liteプロパティ
struct EchonetLiteProp final {
  uint8_t epc;   // ECHONET Liteプロパティ
  uint8_t pdc;   // EDTのバイト数
  uint8_t edt[]; // プロパティ値データ
};
static_assert(sizeof(EchonetLiteProp) == 2);

// ECHONET Lite データ (EDATA)
struct EchonetLiteData final {
  EchonetLiteObjectCode seoj; // 送信元ECHONET Liteオブジェクト指定
  EchonetLiteObjectCode deoj; // 相手元ECHONET Liteオブジェクト指定
  EchonetLiteESV esv;         // ECHONET Liteサービス
  uint8_t opc;                // 処理プロパティ数
  EchonetLiteProp props[];    // ECHONET Liteプロパティ
};
static_assert(sizeof(EchonetLiteData) == 8);

// ECHONET Lite フレーム
struct EchonetLiteFrame final {
  EchonetLiteEHeader ehd;       // ECHONET Lite 電文ヘッダー
  EchonetLiteTransactionId tid; // トランザクションID
  EchonetLiteData edata;        // ECHONET Lite データ (EDATA)
};
static_assert(sizeof(EchonetLiteFrame) == 12);

// EDATAからECHONET Liteプロパティを取り出す
std::vector<std::vector<uint8_t>>
splitToEchonetLiteData(const EchonetLiteData &edata) {
  std::vector<std::vector<uint8_t>> result;
  auto ptr = reinterpret_cast<const uint8_t *>(&edata.props[0]);
  for (auto k = 0; k < edata.opc; ++k) {
    std::vector<uint8_t> v;
    uint8_t epc = *ptr++;
    uint8_t pdc = *ptr++;
    v.push_back(epc);
    v.push_back(pdc);
    std::copy_n(ptr, pdc, std::back_inserter(v));
    ptr += pdc;
    result.emplace_back(std::move(v));
  }
  return result;
}

//
std::string to_string(const EchonetLiteFrame &frame) {
  std::ostringstream oss;
  oss << "EHD:"s << to_string(frame.ehd);
  oss << ",TID:"s << to_string(frame.tid);
  oss << ",SEOJ:"s << to_string(frame.edata.seoj);
  oss << ",DEOJ:"s << to_string(frame.edata.deoj);
  oss << ",ESV:"s << to_string(frame.edata.esv);
  oss << std::uppercase << std::hex;
  oss << ",OPC:"s << std::setfill('0') << std::setw(2) << +frame.edata.opc;
